{
    "translations": {
        "Failed to clear the mappings.": "Xóa định vị thất bại.",
        "Failed to delete the server configuration": "Xóa cấu hình máy chủ thất bại",
        "The configuration is invalid: anonymous bind is not allowed.": "Cấu hình không hợp lệ: không cho phép xác nhận tài khoản nặc danh",
        "The configuration is valid and the connection could be established!": "Cấu hình hợp lệ và kết nối có thể được thiết lập!",
        "The configuration is valid, but the Bind failed. Please check the server settings and credentials.": "Cấu hình hợp lệ, nhưng xác nhận tài khoản đã thất bại. Vui lòng kiểm tra thiết lập máy chủ và các thông tin đăng nhập.",
        "The configuration is invalid. Please have a look at the logs for further details.": "Cấu hình không hợp lệ. Vui lòng kiểm tra đăng nhập để biết thêm chi tiết.",
        "No action specified": "Không có hoạt động cụ thể",
        "No configuration specified": "Không có cấu hình cụ thể",
        "No data specified": "Không có dữ liệu cụ thể",
        "Could not set configuration %s": "Không thể thiết lập cấu hình %s",
        "Action does not exist": "Hoạt động không tồn tại",
        "The Base DN appears to be wrong": "DN Cơ sở có vẻ sai",
        "Testing configuration…": "Đang kiểm tra cấu hình…",
        "Configuration incorrect": "Cấu hình sai",
        "Configuration incomplete": "Cấu hình chưa hoàn tất",
        "Configuration OK": "Cấu hình OK",
        "Select groups": "Chọn nhóm",
        "Select object classes": "Chọn lớp đối tượng",
        "Please check the credentials, they seem to be wrong.": "Vui lòng kiểm tra thông tin, chúng có vẻ sai.",
        "Please specify the port, it could not be auto-detected.": "Vui lòng xác định cổng thông tin, không thể tự động phát hiện.",
        "Base DN could not be auto-detected, please revise credentials, host and port.": "Không thể tự động phát hiện DN Cơ sở , vui lòng xem lại thông tin, máy chủ và cổng.",
        "Could not detect Base DN, please enter it manually.": "Không thể phát hiện cơ sở BN , vui lòng nhập thủ công.",
        "{nthServer}. Server": "{nthServer}. Máy chủ",
        "No object found in the given Base DN. Please revise.": "Không tìm thấy đối tượng trong DN Cơ sở cung cấp. Vui lòng xem lại.",
        "More than 1,000 directory entries available.": "Hơn 1000 thư mục nhập liệu có sẵn.",
        "entries available within the provided Base DN": "nhập liệu có sẵn trong DN Cơ sở được cung cấp",
        "An error occurred. Please check the Base DN, as well as connection settings and credentials.": "Xảy ra lỗi. Vui lòng kiểm tra DN Cơ sở, cũng như thiết lập kết nối và thông tin đăng nhập.",
        "Do you really want to delete the current Server Configuration?": "Bạn có thực sự muốn xóa cấu hình máy chủ hiện tại?",
        "Confirm Deletion": "Xác nhận xóa",
        "Mappings cleared successfully!": "Xóa định vị thành công!",
        "Error while clearing the mappings.": "Lỗi khi xóa định vị.",
        "Anonymous bind is not allowed. Please provide a User DN and Password.": "Xác nhận tài khoản ẩn danh không được phép. Vui lòng cung cấp DN người dùng và mật khẩu.",
        "LDAP Operations error. Anonymous bind might not be allowed.": "Hoạt động LDAP lỗi. Xác nhận tài khoản ẩn danh có thể không được phép.",
        "Saving failed. Please make sure the database is in Operation. Reload before continuing.": "Lưu thất bại. Vui lòng đảm bảo cơ sở dữ liệu đang hoạt động. Tải lại trước khi tiếp tục.",
        "Switching the mode will enable automatic LDAP queries. Depending on your LDAP size they may take a while. Do you still want to switch the mode?": "Thay đổi chế độ sẽ kích hoạt truy vấn LDAP tự động. Dựa vào kích cỡ LDAP sẽ tốn một chút thời gian. Bạn vẫn muốn đổi chế độ?",
        "Mode switch": "Đổi chế độ",
        "Select attributes": "Chọn thuộc tính",
        "User not found. Please check your login attributes and username. Effective filter (to copy-and-paste for command line validation): <br\/>": "Không tìm thấy người dùng. Vui lòng kiểm tra thuộc tính đăng nhập của bạn và tên người dùng. Bộ lọc hiệu quả (để sao-và-dán cho việc xác nhận dòng lệnh): <\/br>",
        "User found and settings verified.": "Đã tìm thấy người dùng và thiết lập được xác nhận.",
        "Settings verified, but one user found. Only the first will be able to login. Consider a more narrow filter.": "Thiết lập được xác nhận, nhưng chỉ tìm thấy một người dùng. Chỉ ngời đầu tiên có thể đăng nhập. Hãy xem xét một bộ lọc hẹp hơn.",
        "An unspecified error occurred. Please check the settings and the log.": "Xảy ra lỗi không xác định. Vui lòng kiểm tra thiết lập và đăng nhập.",
        "The search filter is invalid, probably due to syntax issues like uneven number of opened and closed brackets. Please revise.": "Bộ lọc tìm kiếm không hơpj lệ, có thể do vấn đề cú pháp như số không tương ứng của các giỏ được mở và đóng. Vui lòng xem lại.",
        "A connection error to LDAP \/ AD occurred, please check host, port and credentials.": "Lỗi kết nối đến LDAP\/AD, vui lòng kiểm tra máy chủ, cổng và thông tin đăng nhập.",
        "The %uid placeholder is missing. It will be replaced with the login name when querying LDAP \/ AD.": "Thẻ giữ chỗ %uid bị thiếu. Nó sẽ được thay thế bằng tên đăng nhập khi truy vấn LDAP\/AD.",
        "Please provide a login name to test against": "Vui lòng cung cấp một tên đăng nhập để kiểm tra",
        "The group box was disabled, because the LDAP \/ AD server does not support memberOf.": "Ô nhóm bị vô hiệu, vì máy chủ LDAP \/ AD không hỗ trợ trường 'thành viên của'.",
        "_%s group found_::_%s groups found_": "_%s tìm thấy nhóm_::_%s tìm thấy các nhóm_",
        "_%s user found_::_%s users found_": "_%s tìm thấy người dùng_::_%s tìm thấy những người dùng_",
        "Could not detect user display name attribute. Please specify it yourself in advanced ldap settings.": "Không thể phát hiện thuộc tính hiển thị tên người dùng. Vui lòng tự xác định nó trong phần thiết lập Idap nâng cao.",
        "Could not find the desired feature": "Không thể tìm thấy đặc tính mong muốn",
        "Invalid Host": "Máy chủ không hợp lệ",
        "Server": "Máy chủ ",
        "Users": "Người dùng",
        "Login Attributes": "Thuộc tính đăng nhập",
        "Groups": "Nhóm",
        "Test Configuration": "Kiểm tra cấu hình",
        "Help": "Hỗ trợ",
        "Groups meeting these criteria are available in %s:": "Nhóm thỏa mãn những tiêu chí sau có sẵn trong %s:",
        "Only these object classes:": "Chỉ có những lớp đối tượng sau:",
        "Only from these groups:": "Chỉ từ những nhóm sau:",
        "Search groups": "Tìm nhóm",
        "Available groups": "Nhóm sẵn có",
        "Selected groups": "Nhóm được chọn",
        "Edit LDAP Query": "Chỉnh sửa Truy vấn LDAP",
        "LDAP Filter:": "Bộ lọc LDAP:",
        "The filter specifies which LDAP groups shall have access to the %s instance.": "Bộ lọc xác định nhóm LDAP nào có thể truy cập trường hợp %s.",
        "Verify settings and count groups": "Xác nhận thiết lập và đếm nhóm",
        "When logging in, %s will find the user based on the following attributes:": "Khi đăng nhập, %s sẽ tìm thấy người dùng dựa vào các thuộc tính sau:",
        "LDAP \/ AD Username:": "Tên người dùng LDAP \/ AD:",
        "Allows login against the LDAP \/ AD username, which is either uid or samaccountname and will be detected.": "Cho phép đăng nhập tên người dùng LDAP \/ AD, có thể cả uid hoặc samaccountname và sẽ được phát hiện.",
        "LDAP \/ AD Email Address:": "Địa chỉ email LDAP \/ AD:",
        "Allows login against an email attribute. Mail and mailPrimaryAddress will be allowed.": "Cho phép đăng nhập vào thuộc tính email. Thư và mailPrimaryAddress (Địa chỉ thư gốc) sẽ được phép.",
        "Other Attributes:": "Thuộc tính khác:",
        "Defines the filter to apply, when login is attempted. %%uid replaces the username in the login action. Example: \"uid=%%uid\"": "Xác định bộ lọc để áp dụng, khi muốn đăng nhập. %%uid thay thế tên người dùng trong hoạt động đăng nhập. Ví dụ: \"uid=%%uid\"",
        "Test Loginname": "Kiểm tra tên đăng nhập",
        "Verify settings": "Xác định thiết lập",
        "1. Server": "1. Máy chủ",
        "%s. Server:": "%s. Máy chủ:",
        "Add a new and blank configuration": "Thêm cấu hình mới và trống",
        "Copy current configuration into new directory binding": "Sao cấu hình hiện tại vào xác nhận thư mục mới",
        "Delete the current configuration": "Xóa cấu hình hiện tại",
        "Host": "Máy chủ",
        "You can omit the protocol, except you require SSL. Then start with ldaps:\/\/": "Bạn có thể bỏ qua các giao thức, ngoại trừ bạn yêu cầu SSL. Sau đó bắt đầu với ldaps:\/\/",
        "Port": "Cổng",
        "Detect Port": "Phát hiện cổng",
        "User DN": "DN người dùng",
        "The DN of the client user with which the bind shall be done, e.g. uid=agent,dc=example,dc=com. For anonymous access, leave DN and Password empty.": "DN của người dùng khách với nó việc xác nhận tài khoản có thể hoàn tất, ví dụ: uid=agent,dc=example,dc=com. Để truy cập ẩn danh, hãy để trống DN và mật khẩu.",
        "Password": "Mật khẩu",
        "For anonymous access, leave DN and Password empty.": "Để truy cập ẩn danh, hãy để trống DN và mật khẩu.",
        "One Base DN per line": "Một DN Cơ sở mỗi dòng",
        "You can specify Base DN for users and groups in the Advanced tab": "Bạn có thể xác định DN Cơ sở cho người dùng và nhóm trong tab Nâng cao",
        "Detect Base DN": "Phát hiện DN Cơ sở",
        "Test Base DN": "Thử nghiệm DN Cơ sở",
        "Avoids automatic LDAP requests. Better for bigger setups, but requires some LDAP knowledge.": "Tránh yêu cầu LDAP tự động. Nên thiết lập cụ thể thơn, nhưng yêu cầu tri thức LDAP.",
        "Manually enter LDAP filters (recommended for large directories)": "Nhập thủ công bộ lọc LDAP (khuyến khích cho thư mục lớn)",
        "%s access is limited to users meeting these criteria:": "Truy cập %s bị giới hạn cho người dùng đáp ứng được các tiêu chí sau:",
        "The most common object classes for users are organizationalPerson, person, user, and inetOrgPerson. If you are not sure which object class to select, please consult your directory admin.": "Các lớp đối tượng phổ biến nhất cho người dùng là organizationalPerson, người, người dùng và inetOrgPerson. Nếu bạn không biết chắc lựa chọn lớp đối tượng nào, vui lòng tham khảo ý kiến thư mục quản trị của bạn .",
        "The filter specifies which LDAP users shall have access to the %s instance.": "Bộ lọc xác định người dùng LDAP nào có thể truy cập vào trường hợp %s.",
        "Verify settings and count users": "Xác định thiết lập và đếm người dùng",
        "Saving": "Đang lưu",
        "Back": "Quay lại",
        "Continue": "Tiếp tục",
        "LDAP": "LDAP",
        "Expert": "Chuyên gia",
        "Advanced": "Nâng cao",
        "<b>Warning:<\/b> Apps user_ldap and user_webdavauth are incompatible. You may experience unexpected behavior. Please ask your system administrator to disable one of them.": "<b>Cảnh báo:<\/b> Ứng dụng user_ldap và user_webdavauthlà không tương thích. Bạn sẽ gặp trường hợp không mong muốn. Vui lòng hỏi quản trị viên hệ thống của bạn để tắt một trong hai. ",
        "<b>Warning:<\/b> The PHP LDAP module is not installed, the backend will not work. Please ask your system administrator to install it.": "<b>Cảnh báo:<\/b> Các mô-đun PHP LDAP không được cài đặt, phụ trợ sẽ không làm việc. Xin vui lòng hỏi quản trị viên hệ thống của bạn để cài đặt nó.",
        "Connection Settings": "Thiết lập kết nối",
        "Configuration Active": "Cấu hình đang hoạt động",
        "When unchecked, this configuration will be skipped.": "Nếu không kiểm, cấu hình này sẽ bị bỏ qua.",
        "Backup (Replica) Host": "Máy chủ sao lưu (Replica)",
        "Give an optional backup host. It must be a replica of the main LDAP\/AD server.": "Hãy đưa ra lựa chọn máy chủ sao lưu. Có thể là replica hoặc máy chủ LDAP \/ AD chính.",
        "Backup (Replica) Port": "Cổng sao lưu (Replica)",
        "Disable Main Server": "Tắt máy chủ chính",
        "Only connect to the replica server.": "Chỉ kết nối đến máy chủ replica.",
        "Turn off SSL certificate validation.": "Tắt xác nhận chứng chỉ SSL.",
        "Not recommended, use it for testing only! If connection only works with this option, import the LDAP server's SSL certificate in your %s server.": "Không được khuyến khích, chỉ dùng để kiểm tra! Nếu kết nối chỉ hoạt động với tùy chọn này, hãy nhập chứng chỉ SSL của máy chủ LDAP trong máy chủ %s của bạn.",
        "Cache Time-To-Live": "Cache Time-To-Live",
        "in seconds. A change empties the cache.": "theo giây. Một sự thay đổi sẽ xóa hết cache.",
        "Directory Settings": "Thiết lập thư mục",
        "User Display Name Field": "Trường tên hiển thị của người dùng",
        "The LDAP attribute to use to generate the user's display name.": "Thuộc tính LDAP dùng để tạo tên hiển thị của người dùng.",
        "2nd User Display Name Field": "Trường tên hiển thị thứ hai của người dùng ",
        "Optional. An LDAP attribute to be added to the display name in brackets. Results in e.g. »John Doe (john.doe@example.org)«.": "Tùy chọn. Một thuộc tính LDAP được thêm vào tên hiển thị trong giỏ. Kết quả trong ví dụ: »John Doe (john.doe@example.org)«.",
        "Base User Tree": "Cây người dùng cơ sở",
        "One User Base DN per line": "Một DN Cơ sở mỗi dòng",
        "User Search Attributes": "Thuộc tính tìm kiếm người dùng",
        "Optional; one attribute per line": "Tùy chọn; một thuộc tính mỗi dòng",
        "Group Display Name Field": "Trường tên hiển thị của nhóm",
        "The LDAP attribute to use to generate the groups's display name.": "Thuộc tính LDAP dùng để tạo tên hiển thị của nhóm.",
        "Base Group Tree": "Cây nhóm cơ sở",
        "One Group Base DN per line": "Một nhóm DN Cơ sở mỗi dòng",
        "Group Search Attributes": "Thuộc tính tìm kiếm nhóm",
        "Group-Member association": "Liên kết Nhóm-Thành viên",
        "Dynamic Group Member URL": "URL nhóm, thành viên năng động",
        "The LDAP attribute that on group objects contains an LDAP search URL that determines what objects belong to the group. (An empty setting disables dynamic group membership functionality.)": "Thuộc tính LDAP mà trong nhóm đối tượng có chứa một URL tìm kiếm LDAP quyết định đối tượng nào thuộc về nhóm. (Thiết lập trống vô hiệu hóa chức năng nhóm thành viên năng động.)",
        "Nested Groups": "Nhóm lồng nhau",
        "When switched on, groups that contain groups are supported. (Only works if the group member attribute contains DNs.)": "Khi được bật, các nhóm chứa nhóm sẽ được hỗ trợ (Chỉ hoạt động nếu thuộc tính thành viên nhóm chứa DNs.)",
        "Paging chunksize": "Phân trang theo cỡ đoạn",
        "Chunksize used for paged LDAP searches that may return bulky results like user or group enumeration. (Setting it 0 disables paged LDAP searches in those situations.)": "Cỡ đoạn được sử dụng cho tìm kiếm LDAP phân trang có thể cho các kết quả cồng kềnh như liệt kê người dùng hoặc nhóm. (Thiết lập bằng 0 để tắt tìm kiếm  LDAP phân trang trong những tình huống này).",
        "Special Attributes": "Thuộc tính đặc biệt",
        "Quota Field": "Trường hạn ngạch",
        "Quota Default": "Mặc định hạn ngạch",
        "in bytes": "theo bytes",
        "Email Field": "trường Email",
        "User Home Folder Naming Rule": "Quy tắc đặt tên thư mục trang chủ người dùng",
        "Leave empty for user name (default). Otherwise, specify an LDAP\/AD attribute.": "Để trống cho tên người dùng (mặc định). Nếu không, xác định một thuộc tính LDAP\/AD.",
        "Internal Username": "Tên người dùng nội bộ",
        "By default the internal username will be created from the UUID attribute. It makes sure that the username is unique and characters do not need to be converted. The internal username has the restriction that only these characters are allowed: [ a-zA-Z0-9_.@- ].  Other characters are replaced with their ASCII correspondence or simply omitted. On collisions a number will be added\/increased. The internal username is used to identify a user internally. It is also the default name for the user home folder. It is also a part of remote URLs, for instance for all *DAV services. With this setting, the default behavior can be overridden. To achieve a similar behavior as before ownCloud 5 enter the user display name attribute in the following field. Leave it empty for default behavior. Changes will have effect only on newly mapped (added) LDAP users.": true,
        "Internal Username Attribute:": "Thuộc tính tên người dùng nội bộ:",
        "Override UUID detection": "Ghi đè phát hiện UUIID:",
        "By default, the UUID attribute is automatically detected. The UUID attribute is used to doubtlessly identify LDAP users and groups. Also, the internal username will be created based on the UUID, if not specified otherwise above. You can override the setting and pass an attribute of your choice. You must make sure that the attribute of your choice can be fetched for both users and groups and it is unique. Leave it empty for default behavior. Changes will have effect only on newly mapped (added) LDAP users and groups.": true,
        "UUID Attribute for Users:": "Thuộc tính UUID cho người dùng:",
        "UUID Attribute for Groups:": "Thuộc tính UUID cho nhóm: ",
        "Username-LDAP User Mapping": "Định vị người dùng Tên người dùng-LDAP",
        "Usernames are used to store and assign (meta) data. In order to precisely identify and recognize users, each LDAP user will have an internal username. This requires a mapping from username to LDAP user. The created username is mapped to the UUID of the LDAP user. Additionally the DN is cached as well to reduce LDAP interaction, but it is not used for identification. If the DN changes, the changes will be found. The internal username is used all over. Clearing the mappings will have leftovers everywhere. Clearing the mappings is not configuration sensitive, it affects all LDAP configurations! Never clear the mappings in a production environment, only in a testing or experimental stage.": true,
        "Clear Username-LDAP User Mapping": "Xóa định vị người dùng Tên người dùng-LDAP"
    },
    "pluralForm": "nplurals=1; plural=0;"
}