{
    "translations": {
        "Cannot write into \"config\" directory!": "Không thể viết vào thư mục \"config\"!",
        "This can usually be fixed by giving the webserver write access to the config directory": "Điều này thường được sửa bằng cách trao quyền truy cập viết máy chủ web cho thư mục cấu hình",
        "See %s": "Xem %s",
        "This can usually be fixed by %sgiving the webserver write access to the config directory%s.": "Điều này thường được sửa bằng cách %s trao quyền truy cập viết máy chủ web cho thư mục cấu hình %s.",
        "Sample configuration detected": "Đã phát hiện cấu hình mẫu",
        "It has been detected that the sample configuration has been copied. This can break your installation and is unsupported. Please read the documentation before performing changes on config.php": true,
        "PHP %s or higher is required.": "PHP %s hoặc cao hơn được yêu cầu.",
        "PHP with a version lower than %s is required.": "PHP %s với phiên bản thấp hơn %s được yêu cầu.",
        "%sbit or higher PHP required.": "%s bit hoặc PHP cao hơn được yêu cầu.",
        "Following databases are supported: %s": "Cơ sở dữ liệu sau được hỗ trợ: %s",
        "The command line tool %s could not be found": "Không tìm thấy công cụ dòng lệnh %s",
        "The library %s is not available.": "Thư viện %s không có sẵn.",
        "Library %s with a version higher than %s is required - available version %s.": "Yêu cầu thư viện %s với phiên bản cao hơn %s - phiên bản có sẵn %s.",
        "Library %s with a version lower than %s is required - available version %s.": "Yêu cầu thư viện %s với phiên bản thấp hơn %s - phiên bản có sẵn %s.",
        "Following platforms are supported: %s": "Các nền tảng sau đây được hỗ trợ:% s",
        "ownCloud %s or higher is required.": "Yêu cầu ownCloud %s hoặc cao hơn.",
        "ownCloud %s or lower is required.": "Yêu cầu ownCloud %s hoặc thấp hơn.",
        "Unknown filetype": "Loại tập tin không xác định",
        "Invalid image": "Hình ảnh không hợp lệ",
        "today": "ngày hôm nay",
        "yesterday": "ngày hôm qua",
        "_%n day ago_::_%n days ago_": "_%n hôm trước_::_%n hôm trước_",
        "last month": "tháng trước",
        "_%n month ago_::_%n months ago_": "_%n tháng trước_::_%n tháng trước_",
        "last year": "năm ngoái",
        "_%n year ago_::_%n years ago_": "_%n năm trước_::_%n năm trước_",
        "_%n hour ago_::_%n hours ago_": "_%n giờ trước_::_%n giờ trước_",
        "_%n minute ago_::_%n minutes ago_": "_%n phút trước_::_%n phút trước_",
        "seconds ago": "giây trước",
        "Module with id: %s does not exist. Please enable it in your apps settings or contact your administrator.": "Môđun với id: %s không tồn tại. Vui lòng cho phép trong phần thiết lập ứng dụng của bạn hoặc liên hệ quản trị viên của bạn.",
        "Empty filename is not allowed": "Không cho phép tên tập tin rỗng",
        "Dot files are not allowed": "Không cho phép tập tin chứa dấu chấm",
        "4-byte characters are not supported in file names": "Ký tự 4-byte không được hỗ trợ trong tên tập tin",
        "File name is a reserved word": "Tên tập tin là một từ dành riêng",
        "File name contains at least one invalid character": "Tên tập tin có chứa ít nhất ký tự không hợp lệ",
        "File name is too long": "Tên tập tini quá dài",
        "App directory already exists": "Thư mục ứng dụng đã tồn tại",
        "Can't create app folder. Please fix permissions. %s": "Không thể tạo thư mục ứng dụng. Vui lòng sửa điều khoản. %s",
        "Archive does not contain a directory named %s": "Lưu trữ không thể chứa thư mục đặt tên là %s",
        "No source specified when installing app": "Không xác định được nguồn khi cài đặt ứng dụng",
        "No href specified when installing app from http": "Không xác định được href khi cài đặt ứng dụng từ http",
        "No path specified when installing app from local file": "Không xác định được đường dẫn khi cài đặt ứng dụng từ tập tin nội bộ",
        "Archives of type %s are not supported": "Không hỗ trợ lưu trữ loại %s",
        "Failed to open archive when installing app": "Mở lưu trữ thất bại khi cài đặt ứng dụng",
        "App does not provide an info.xml file": "Ứng dụng không cung cấp tập tin info.xml",
        "App cannot be installed because appinfo file cannot be read.": "Ứng dụng không thể được cài đặt vì không thể đọc được tập tin thông tin ứng dụng.",
        "Signature could not get checked. Please contact the app developer and check your admin screen.": "Không thể kiểm tra được chữ ký. Vui lòng liên hệ nhà phát triển ứng dụng và kiểm tra màn hình quản trị của bạn.",
        "App can't be installed because of not allowed code in the App": "Ứng dụng không thể được cài đặt vì trong ứng dụng có mã không được phép ",
        "App can't be installed because it is not compatible with this version of ownCloud": "Ứng dụng không thể được cài đặt vì nó khoong tương thích với phiên bản ownCloud này ",
        "App can't be installed because it contains the <shipped>true<\/shipped> tag which is not allowed for non shipped apps": "Ứng dụng không thể được cài đặt vì nó có chứa từ khóa <shipped>đúng<\/shipped> không được phép cho các ứng dụng không chuyển",
        "App can't be installed because the version in info.xml is not the same as the version reported from the app store": "Ứng dụng không thể được cài đặt vì phiên bản  trong info.xml không giống với phiên bản báo cáo trong kho ứng dụng",
        "%s enter the database username and name.": "%s nhập tên người dùng và tên cơ sở dữ liệu.",
        "%s enter the database username.": "%s nhập tên người dùng cơ sở dữ liệu.",
        "%s enter the database name.": "%s nhập tên cơ sở dữ liệu.",
        "%s you may not use dots in the database name": "%s bạn không thể sử dụng dấu chấm trong tên cơ sở dữ liệu",
        "Oracle connection could not be established": "Kết nối Oracle có thể chưa được thiết lập",
        "Oracle username and\/or password not valid": "Tên người dùng Oracle và\/hoặc mật khẩu không hợp lệ",
        "DB Error: \"%s\"": "Lỗi DB: \"%s\"",
        "Offending command was: \"%s\"": "Lệnh vi phạm là: \"%s\"",
        "You need to enter either an existing account or the administrator.": "Bạn cần nhập tài khoản đã tồn tại hoặc quản trị viên.",
        "Offending command was: \"%s\", name: %s, password: %s": "Lệnh vi phạm là: \"%s\", tên: %s, mật khẩu: %s",
        "PostgreSQL username and\/or password not valid": "Tên người dùng PostgreSQL và\/hoặc mật khẩu không hợp lệ",
        "Mac OS X is not supported and %s will not work properly on this platform. Use it at your own risk!": "Mac OS X không được hỗ trợ và%s không hoạt động chính xác trên nền tảng này. Sử dụng sẽ gây nguy hại cho bạn!",
        "For the best results, please consider using a GNU\/Linux server instead.": "Để có kết quả tốt nhất, vui lòng xem xét sử dụng máy chủ GNU\/Linux thay thế.",
        "It seems that this %s instance is running on a 32-bit PHP environment and the open_basedir has been configured in php.ini. This will lead to problems with files over 4 GB and is highly discouraged.": true,
        "Please remove the open_basedir setting within your php.ini or switch to 64-bit PHP.": "Vui lòng loại bỏ thiết lập open_basedir trong php.ini của bạnhoặc chuyển sang 64-bit PHP.",
        "Set an admin username.": "Thiết lập tên người dùng quản trị.",
        "Set an admin password.": "Thiết lập mật khẩu quản trị.",
        "Can't create or write into the data directory %s": "Không thể tạo hoặc viết vào thư mục dữ liệu %s",
        "Invalid Federated Cloud ID": "ID đám mây tổ hợp không hợp lệ",
        "%s shared »%s« with you": "%s đã chia sẻ »%s« với bạn",
        "%s via %s": "%s thông qua %s",
        "Sharing %s failed, because the backend does not allow shares from type %i": "Chia sẻ %s thất bại, vì phụ trợ không cho phép chia sẻ từ loại %i",
        "Sharing %s failed, because the file does not exist": "Chia sẻ %s thất bại, vì tập tin không tồn tại",
        "You are not allowed to share %s": "Bạn không được phép chia sẻ %s",
        "Sharing %s failed, because you can not share with yourself": "Chia sẻ %s thất bại, vì bạn không thể chia sẻ cho chính mình",
        "Sharing %s failed, because the user %s does not exist": "Chia sẻ %s thất bại, vì người dùng %s không tồn tại",
        "Sharing %s failed, because the user %s is not a member of any groups that %s is a member of": "Chia sẻ %s thất bại, vì người dùng %s không phải là thành viên của bất cứ nhóm nào mà %s là thành viên",
        "Sharing %s failed, because this item is already shared with %s": "Chia sẻ %s thất bại, vì danh mục này đã được chia sẻ với %s",
        "Sharing %s failed, because this item is already shared with user %s": "Chia sẻ %s thất bại, vì danh mục này đã được chia sẻ với người dùng %s",
        "Sharing %s failed, because the group %s does not exist": "Chia sẻ %s thất bại, vì nhóm %s không tồn tại",
        "Sharing %s failed, because %s is not a member of the group %s": "Chia sẻ %s thất bại, vì %s không phải là thành viên của nhóm %s ",
        "You need to provide a password to create a public link, only protected links are allowed": "Bạn cần cung cấp một mật khẩu để tạo liên kết công khai, chỉ cho phép những  liên kết được bảo vệ",
        "Sharing %s failed, because sharing with links is not allowed": "Chia sẻ %s thất bại, vì không cho phép chia sẻ với liên kết này",
        "Not allowed to create a federated share with the same user": "Không cho phép tạo chia sẻ tổ hợp với cùng người dùng",
        "Sharing %s failed, could not find %s, maybe the server is currently unreachable.": "Chia sẻ %s thất bại, không tìm thấy %s, có thể máy chủ hiện tại không thể kết nối được",
        "Share type %s is not valid for %s": "Loại chia sẻ %s không hợp lệ cho %s",
        "Setting permissions for %s failed, because the permissions exceed permissions granted to %s": "Thiết lập điều khoản cho %s thất bại, vì các điều khoản đã vượt quá quyền hạn trao cho %s",
        "Setting permissions for %s failed, because the item was not found": "Thiết lập điều khoản cho %s thất bại, vì không tìm thấy danh mục",
        "Cannot set expiration date. Shares cannot expire later than %s after they have been shared": "Không thể tạo ngày hết hạn. Chia sẻ không thể hết hạn muộn hơn %s sau khi chúng được chia sẻ",
        "Cannot set expiration date. Expiration date is in the past": "Không thể tạo ngày hết hạn. Ngày hết hạn đã qua",
        "Cannot clear expiration date. Shares are required to have an expiration date.": "Không thể xóa ngày hết hạn. Việc chia sẻ yêu cầu phải có ngày hết hạn.",
        "Sharing backend %s must implement the interface OCP\\Share_Backend": "Phụ trợ chia sẻ %s phải sử dụng giao diện OCP\\Share_Backend",
        "Sharing backend %s not found": "Không tìm thấy phụ trợ chia sẻ %s  ",
        "Sharing backend for %s not found": "Không tìm thấy phụ trợ chia sẻ cho %s  ",
        "Sharing failed, because the user %s is the original sharer": "Chia sẻ %s thất bại, vì người dùng %s là người chia sẻ đầu tiên",
        "Sharing %s failed, because the permissions exceed permissions granted to %s": "Chia sẻ %s thất bại, vì các điều khoản đã vượt quá quyền hạn trao cho %s",
        "Sharing %s failed, because resharing is not allowed": "Chia sẻ %s thất bại, vì không cho phép chia sẻ lại",
        "Sharing %s failed, because the sharing backend for %s could not find its source": "Chia sẻ %s thất bại, vì không thể tìm thấy nguồn của phụ trợ chia sẻ cho %s ",
        "Sharing %s failed, because the file could not be found in the file cache": "Chia sẻ %s thất bại, vì không tìm thấy tập tin trong tập tin cache",
        "Cannot increase permissions of %s": "Không thể tăng điều khoản của %s",
        "Files can't be shared with delete permissions": "Tập tin không thể chia sẻ với các điều khoản xóa",
        "Files can't be shared with create permissions": "Tập tin không thể chia sẻ với các điều khoản tạo",
        "Expiration date is in the past": "Ngày hết hạn đã qua",
        "Cannot set expiration date more than %s days in the future": "Không thể thiết lập ngày hết hạn sớm hơn %s ngày trong tương lai",
        "Could not find category \"%s\"": "Không thể tìm thấy danh mục \"%s\"",
        "Apps": "Ứng dụng",
        "Only the following characters are allowed in a username: \"a-z\", \"A-Z\", \"0-9\", and \"_.@-'\"": "Chỉ cho phép những ký tự sau trong tên người dùng: \"a-z\", \"A-Z\", \"0-9\", và  \"_.@-'\"",
        "A valid username must be provided": "Phải cung cấp một tên người dùng hợp lệ",
        "Username contains whitespace at the beginning or at the end": "Tên người dùng có chứa khoảng trắng ở đầu hoặc cuối",
        "A valid password must be provided": "Phải cung cấp một mật khẩu hợp lệ",
        "The username is already being used": "Tên người dùng đã được sử dụng",
        "Login canceled by app": "Đăng nhập đã bị hủy bỏ do ứng dụng",
        "User disabled": "Người dùng vô hiệu",
        "Help": "Hỗ trợ",
        "Personal": "Cá nhân",
        "Users": "Người dùng ",
        "Admin": "Quản trị viên",
        "Recommended": "Được đề nghị",
        "App \"%s\" cannot be installed because appinfo file cannot be read.": "Ứng dụng \"%s\" không thể được cài đặt vì tập tin thông tin ứng dụng không thể đọc được.",
        "App \"%s\" cannot be installed because it is not compatible with this version of ownCloud.": "Ứng dụng \"%s\" không thể được cài đặt vì nó không tương thích với phiên bản ownCloud này.",
        "App \"%s\" cannot be installed because the following dependencies are not fulfilled: %s": "Ứng dụng \"%s\" không thể được cài đặt vì điều khoản đi kèm sau chưa được đáp ứng: %s",
        "No app name specified": "Không xác định được tên ứng dụng",
        "web services under your control": "Dịch vụ web dưới quyền kiểm soát của bạn",
        "File is currently busy, please try again later": "Tập tin hiện tại đang bận, vui lòng thử lại sau",
        "Can't read file": "Không thể đọc tập tin",
        "Application is not enabled": "Ứng dụng chưa được kích hoạt",
        "Authentication error": "Lỗi xác thực",
        "Token expired. Please reload page.": "Mã thông báo đã hết hạn. Vui lòng tải lại trang.",
        "Unknown user": "Người dùng không xác định",
        "No database drivers (sqlite, mysql, or postgresql) installed.": "Không có driver cơ sở dữ liệu (sqlite, mysql, hoặc postgresql) được cài đặt",
        "Microsoft Windows Platform is not supported": "Nền tảng Microsoft Windows không được hỗ trợ",
        "Running ownCloud Server on the Microsoft Windows platform is not supported. We suggest you use a Linux server in a virtual machine if you have no option for migrating the server itself. Find Linux packages as well as easy to deploy virtual machine images on <a href=\"%s\">%s<\/a>. For migrating existing installations to Linux you can find some tips and a migration script in <a href=\"%s\">our documentation<\/a>.": true,
        "Cannot write into \"config\" directory": "Không thể viết vào thư mục \"config\"",
        "Cannot write into \"apps\" directory": "Không thể viết vào thư mục \"apps\"",
        "This can usually be fixed by %sgiving the webserver write access to the apps directory%s or disabling the appstore in the config file.": "Điều này thường được sửa bằng cách %s cung cấp quyền truy cập viết máy chủ web cho thư mục ứng dụng %s hoặc vô hiệu kho ứng dụng trong tập tin cấu hình.",
        "Cannot create \"data\" directory (%s)": "Không thể tạo thư mục \"data\" (%s)",
        "This can usually be fixed by <a href=\"%s\" target=\"_blank\" rel=\"noreferrer\">giving the webserver write access to the root directory<\/a>.": "Điều này thường được sửa bằng cách <a href=\"%s\" target=\"_blank\" rel=\"noreferrer\"> cung cấp quyền truy cập viết máy chủ web cho thư mục gốc <\/a> .",
        "Permissions can usually be fixed by %sgiving the webserver write access to the root directory%s.": "Điều khoản thường được sửa bằng cách %s cung cấp quyền truy cập viết máy chủ web cho thư mục gốc %s.",
        "Setting locale to %s failed": "Thiết lập miền địa phương với %s thất bại",
        "Please install one of these locales on your system and restart your webserver.": "Xin vui lòng cài đặt một trong những miền địa phương này trên hệ thống của bạn và khởi động lại máy chủ web của bạn.",
        "Please ask your server administrator to install the module.": "Vui lòng hỏi quản trị viên máy chủ của bạn để cài đặt môđun.",
        "PHP module %s not installed.": "Môđun PHP %s không được cài đặt.",
        "PHP setting \"%s\" is not set to \"%s\".": "Thiết lập PHP \"%s\" không được thiết lập cho \"%s\".",
        "Adjusting this setting in php.ini will make ownCloud run again": "Điều chỉnh thiết lập này trong php.ini sẽ khhiến ownCloud chạy lại.",
        "mbstring.func_overload is set to \"%s\" instead of the expected value \"0\"": "mbstring.func_overload được thiết lập thành \"%s\" thay vì giá trị dự kiến \"0\"",
        "To fix this issue set <code>mbstring.func_overload<\/code> to <code>0<\/code> in your php.ini": "Để sửa vấn đề này thiết lập <code>mbstring.func_overload<\/code> thành <code>0<\/code> trong php.ini của bạn",
        "libxml2 2.7.0 is at least required. Currently %s is installed.": "yêu cầu ít nhất libxml2 2.7.0. Hiện tại %s được cài đặt.",
        "To fix this issue update your libxml2 version and restart your web server.": "Để sửa vấn đề này cập nhật phiên bản libxml2 của bạn và khởi động lại máy chủ web.",
        "PHP is apparently set up to strip inline doc blocks. This will make several core apps inaccessible.": "PHP thường được thiết lập để xóa khối doc theo dòng. Điều này khiến một số ứng dụng cơ bản không thể truy cập được.",
        "This is probably caused by a cache\/accelerator such as Zend OPcache or eAccelerator.": "Điều này có thể do cache\/ accelerator như Zend OPcache hoặc eAccelerator.",
        "PHP modules have been installed, but they are still listed as missing?": "Môđun PHP đã được cài đặt, nhưng chúng vẫn được liệt kê là thiếu?",
        "Please ask your server administrator to restart the web server.": "Vui lòng hỏi quản trị viên máy chủ của bạn để khởi động lại máy chủ web.",
        "PostgreSQL >= 9 required": "Yêu cầu PostgreSQL >= 9 ",
        "Please upgrade your database version": "Vui lòng nâng cấp phiên bản cơ sở dữ liệu của bạn",
        "Please change the permissions to 0770 so that the directory cannot be listed by other users.": "Vui lòng thay đổi điều khoản thành 0770 để thư mục không bị liệt kê bởi người dùng khác.",
        "Data directory (%s) is readable by other users": "Người dùng khác có thể đọc được thư mục dữ liệu (%s) ",
        "Data directory (%s) must be an absolute path": "Thư mục dữ liệu (%s) phải là một đường dẫn chính xác",
        "Check the value of \"datadirectory\" in your configuration": "Kiểm tra giá trị \"datadirectory\" trong cấu hình của bạn",
        "Data directory (%s) is invalid": "Thư mục dữ liệu (%s) không hợp lệ",
        "Please check that the data directory contains a file \".ocdata\" in its root.": "Vui lòng kiểm tra thư mục dữ liệu này có chứa tập tin \".ocdata\" trong tập tin gốc.",
        "Could not obtain lock type %d on \"%s\".": "Không có được khóa loại %d vào \"%s\".",
        "Storage unauthorized. %s": "Bộ nhớ trái phép. %s",
        "Storage incomplete configuration. %s": "Cấu hình bộ nhớ chưa hoàn thành. %s",
        "Storage connection error. %s": "Lỗi kết nối bộ nhớ. %s",
        "Storage not available": "Bộ nhớ không có sẵn"
    },
    "pluralForm": "nplurals=1; plural=0;"
}